In [7]:
import pandas as pd
df = pd.DataFrame(
       {
            "Name": [
                "Mr. Pravinkumar Prajapati",
                "Miss. Priyanka Paul",
               "Miss. Elizabeth",
           ],
            "Age": [22, 30, 58],
            "Sex": ["male", "female", "female"],
        }
    )

In [8]:
df

                        Name  Age     Sex
0  Mr. Pravinkumar Prajapati   22    male
1        Miss. Priyanka Paul   30  female
2            Miss. Elizabeth   58  female

In [6]:
df["Age"]

0    22
1    35
2    58
Name: Age, dtype: int64

In [9]:
df["Age"].max()

58

In [10]:
df.describe()

             Age
count   3.000000
mean   36.666667
std    18.903263
min    22.000000
25%    26.000000
50%    30.000000
75%    44.000000
max    58.000000